app/Http/Controllers/Auth/AuthenticatedSessionController.php

    public function store(LoginRequest $request): RedirectResponse
    {
        $request->authenticate();

        $request->session()->regenerate();

	// JUST FOR SHOW! Place a user list in the newly generated session so that it can be accessed from the dasboard blade
		$request->session()->put('usersList', User::all());
---
select * from `users`