app/Http/Controllers/Auth/RegisteredUserController.php

insert into `users` (`name`, `email`, `nif`, `password`, `updated_at`, `created_at`) values ('michele', 'michele@gmail.com', '123433878', '$2y$10$Kmh7tSVynMLEPHf9SoeM2OHiVfCLS6iV7zlZI7KPi7T0UiMc.qN9C', '2023-05-29 18:19:32', '2023-05-29 18:19:32')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:'.User::class],
	    'nif' => ['required', 'digits:9', 'unique:users'],
	    'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
	    'email' => $request->email,
	    'nif' => $request->nif,
            'password' => Hash::make($request->password),
        ]);