routes/api.php

select * from `products` where `title` like '%voluptate ex quasi sed%'
---

Route::get('/search', function(Request $request){
    $searchTerm = $request->search;
    $products =  Product::where('title', 'like', '%'.$searchTerm.'%')->get();