app/Http/Controllers/ProductController.php

select * from `products` order by `price` desc limit 5 offset 0
select count(*) as aggregate from `products`
---
    public function index()
	{
		$data['products'] = Product::orderBy('price','desc')->paginate(5);

select * from `products` where `products`.`id` = '11' limit 1
---
	public function edit(string $id){
		 $product = Product::find($id);

select * from `products` where `products`.`id` = '11' limit 1
---
    public function update(Request $request, string $id)
    {
     //validate fields. In this case, only price and image (may or may not be changed)
	 $receivedProductData = $request->validate([
	 'price' => 'required|numeric|between:0,500',
	 'image' => 'nullable|image|mimes:jpeg,png,jpg',
	 ]);
	 $originalProduct = Product::find($id);

update `products` set `image` = '1685385790_profile.png', `products`.`updated_at` = '2023-05-29 18:43:10' where `id` = 11
---
	}
	}
	//update data
	$originalProduct->save();